# task4 Користувач вводить текст через пробіл. Конвертувати текст у список. Вивести останні 3 елементи зі списку, якщо список містить менше 3-х елементів, вивести повідомлення про те що кількість елементів менша за 3 і вказати кількість елементів поточного списку

user_text = input('Текст через пробіл вписувати тут: ')

words_list = user_text.split()

if len(words_list) >=3:
    last_three_words = words_list[-3:]
    print('Останні 3 слова', last_three_words)
else:
    print('кількість елементів менша за 3: ', len(words_list))